Repository: 84000/data-translation-memory
Catalog: toh79-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་བཟང་པོས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་དེ་ལྟར་ཆོས་ཀྱི་གཏམ་ཆེན་པོ་འབྱུང་བར་འགྱུར་ན། ཁྱེད་ཀྱི་ནང་ནས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་འགྲོ་བར་སྤྲོ་བ་སུ་ཡོད།
en: Then the bhagavān tathāgata Samantabhadra asked the bodhisattvas, “Heirs of the lineage, if another great Dharma discourse such as this were to take place there, who among you would like to go to the Sahā world?”

source: བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་སྒྲོན་མ་འཛིན་ཅེས་བྱ་བ་དེར་འདུས་ཏེ་འདུག་པར་གྱུར་པ་དེས་བཅོམ་ལྡན་འདས་དེ་ལ་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་མཆི་བར་སྤྲོ་ལགས་སོ། །
en: The bodhisattva called Holding the Lamp of Gnosis, who was seated among those gathered there, said to the bhagavān, “Bhagavān, I would like to go to the Sahā world.”

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ད་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་སོང་ཤིག །
en: The bhagavān replied, “Heir of the lineage, go there when you know the time is opportune.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་སྒྲོན་མ་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བཅུས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་དེ་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ཏེ།
en: Then the bodhisattva great being Holding the Lamp of Gnosis, surrounded and accompanied by a hundred million bodhisattvas, bowed his head to the bhagavān’s feet, circumambulated the bhagavān seven times, and disappeared from that buddhafield.

source: དཔེར་ན་སྐྱེས་བུ་སྟོབས་དང་ལྡན་པས་ལག་པ་བསྐུམ་པ་ལས་བརྐྱང་བ་དང་། བརྐྱང་བ་ལས་བསྐུམ་པ་ཙམ་གྱི་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་མི་སྣང་བར་གྱུར་ནས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་དགའ་ལྡན་གྱི་གནས་སུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་མདུན་གྱི་སྟེང་གི་བར་སྣང་ལ་གནས་པའི་ཁང་པ་བརྩེགས་པར་ཕྱིན་ཏོ། །
en: In an instant, as long as it takes for an able-bodied person to stretch out and then draw back their arm, he arrived in a hall with an upper chamber situated in the space above and in front of Mañjuśrī Kumārabhūta, there in the Heaven of Joy of the Sahā world.

source: དེའི་གཡོག་འཁོར་དེ་དག་ཀྱང་ཁང་པ་བརྩེགས་པ་ལེགས་པར་གནས་པ་རྣམས་སུ་ཕྱིན་ཏོ། །དེ་དག་རང་རང་གི་སྟན་ལས་ལངས་ནས་ཐལ་མོ་སྦྱར་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ཞིང་ཚིག་འདི་སྐད་ཅེས་ཀྱང་སྨྲས་སོ། །
en: His servants and entourage also arrived in that well-built hall with an upper chamber.

source: འཇམ་དཔལ་བདག་ཅག་ནི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་ཏུ་བཟང་པོ་དེས་ཁྱོད་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འདིར་བཏང་ངོ་། །
en: Each of them rose from their seats, joined their hands, and prostrated to Mañjuśrī Kumārabhūta, saying these words: “Mañjuśrī, we have been sent here by the bhagavān, tathāgata, arhat, truly perfect Buddha Samantabhadra to see you, to pay our homage and respect, and to listen to your Dharma.

source: ཁྱོད་ཀྱིས་འོད་བཀྱེ་བ་དེ་ཡང་འཇིག་རྟེན་གྱི་ཁམས་དེར་ཕྱིན་ཏོ། །
en: The light you emanated has reached even our world.”

source: དེ་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: The gods of the desire and form realms were amazed to see these bodhisattvas, and spoke these words of praise: “Lo!

source: ཀྱེ་མ་ཇི་ཙམ་དུ་འདི་ལྟར་མྱུར་བར་འོད་ཟེར་འདི་འཇིག་རྟེན་གྱི་ཁམས་དེར་ཕྱིན་པ་དང་།
en: How quickly has this light reached that world!

source: ཇི་ལྟར་མྱུར་བར་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་པ་འདི་ནི་སྐྱེས་བུ་དམ་པ་དེ་དག་གི་མངོན་པར་ཤེས་པའི་རྣམ་པར་འཕྲུལ་པའི་སྟོབས་དང་།
en: How quickly have these bodhisattvas arrived in this Sahā world!

source: ཏིང་ངེ་འཛིན་གྱི་བྱིན་གྱིས་བརླབས་ཀྱི་སྟོབས་བསམ་གྱིས་མི་ཁྱབ་པོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: The magical power of these holy beings’ higher perceptions and the transformative power of their meditative absorption is just inconceivable!”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ལྷའི་འཁོར་ཆེན་པོ་དེ་ལྟར་འདུས་པ་དེ་ལ་ཅི་ནས་ཀྱང་ལྷ་ཁྲག་ཁྲིག་ཕྲག་བདུན་ཅུ་རྩ་གཉིས་བསམ་པ་ཐག་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་ལྟ་དེ་ལྟར་ཆོས་བསྟན་ཏོ། །
en: Then Mañjuśrī Kumārabhūta taught the Dharma to that great assembly of gods gathered there, such that seventy-two hundred billion gods, with sincere resolution, gave rise to the mind set on unsurpassed and perfect awakening.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཇི་སྲིད་དུ་དགའ་ལྡན་གྱི་གནས་སུ་ལྷ་རྣམས་ཀྱི་དོན་བྱ་བ་དེ་སྲིད་དུ་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བཅུ་པོ་དེ་དག་དང་ལྷན་ཅིག །རང་གི་འཁོར་དང་ལྷན་ཅིག །བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ལྷའི་བུ་དང་བཅས་པ་དང་ལྷན་ཅིག་ཏུ་དགའ་ལྡན་གྱི་གནས་ནས་མི་སྣང་བར་གྱུར་ཏེ།
en: Once he had done everything he could possibly do to help the gods in the Heaven of Joy, Mañjuśrī Kumārabhūta—along with those hundred million bodhisattvas, and together with Śakra, Brahmā, and the world-protecting gods—then disappeared from the Heaven of Joy.

source: སེམས་ཀྱི་འགྱུ་བ་ཙམ་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱིན་ནས།
en: In an instant, as long as it takes for a flicker of thought, they arrived back in the presence of the Bhagavān.

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་སྟེ། ཕྱོགས་གཅིག་ཏུ་རང་རང་གི་སྟན་ལ་འཁོད་དོ། །
en: They bowed their heads to the Bhagavān’s feet, circumambulated the Bhagavān seven times, and with the Bhagavān’s consent, they took their seats to one side.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་སྒྲོན་མ་འཛིན་དང་ལྷན་ཅིག་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བཅུ་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the hundred million bodhisattvas who had arrived with the bodhisattva called Holding the Lamp of Gnosis bowed their heads to the Bhagavān’s feet, circumambulated him seven times, and, joining their palms before the Bhagavān, said, “The bhagavān tathāgata Samantabhadra sends the Bhagavān his greetings.

source: བཅོམ་ལྡན་འདས་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་བཟང་པོ་གནོད་པ་ཆུང་ངམ། ཉམ་ང་བ་ཉུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། སྟོབས་དང་བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་སྙུན་གསོལ་ཏོ། །
en: He inquires after the Bhagavān’s health, whether he has any minor ailments, discomforts, or disturbances, and if he remains strong and well.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ཆོས་ཀྱི་གཏམ་གྱིས་ཡང་དག་པར་དགའ་བར་མཛད། ཡང་དག་པར་འཛིན་དུ་བཅུག །ཡང་དག་པར་རབ་ཏུ་གཟེངས་སྟོད་དེ་ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དོ། །ཡང་དག་པར་དགའ་བར་མཛད་ཅིང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ལ་ཡང་དག་པར་གཟེངས་སྟོད་དེ།
en: The Bhagavān then delighted those bodhisattvas and the entire assembly there with a Dharma discourse, making them understand, inspiring them, and bringing them great joy.

source: ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་ཀྱང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ལ་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་སྐྱེས་བུ་དམ་པ་འདི་དག་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་སྒྲོན་མ་འཛིན་གྱི་མངོན་པར་ཤེས་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། བྱིན་གྱིས་བརླབས་ཀྱི་སྟོབས་དང་། སེམས་ཅན་སྡུད་པ་དང་། ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། ཐབས་དང་། རིགས་པ་དང་། ཡེ་ཤེས་དང་། ཤེས་རབ་ཀྱི་རབ་ཏུ་དབྱེ་བ་དང་སྤོབས་པ་ལ་ལྟོས།
en: Having delighted them and made them understand, having inspired them and brought them joy, the Bhagavān said to the entire assembly, “Friends, behold the mighty higher perceptions and the transformative power of these holy beings—of Mañjuśrī Kumārabhūta, and of Holding the Lamp of Gnosis—how they gather sentient beings and bring them to full ripening, and their methods, reasonings, gnosis, discriminating wisdom, and eloquence!

source: གྲོགས་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་བསྐལ་པ་གྲངས་མེད་པ་ནས་བཟུང་སྟེ། སངས་རྒྱས་ཀྱི་མཛད་པས་སེམས་ཅན་རྣམས་ལ་ཉེ་བར་གནས་པ་དག་གོ །
en: Friends, for countless eons these bodhisattvas stay close to sentient beings performing a buddha’s deeds.

source: སེམས་ཅན་གང་དག་གིས་དབང་པོ་དྲུག་པོ་དག་ལ་སྐྱེས་བུ་དམ་པ་འདི་དག་མངོན་པར་འགྱུར་བ་དེ་དག་ནི་ཕྱིས་བདུད་ཀྱི་ཡུལ་ལ་གནས་པར་མི་འགྱུར་རོ། །
en: Any sentient being that beholds these holy beings through the six senses will never again abide in the land of māras.”

source: ཞེས་བརྗོད་པར་བྱའོ། །
en: Thus did he speak.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་སྒྲོན་མ་འཛིན་དང་ལྷན་ཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་ཕྱིན་པ་དེ་དག་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལས་ཆོས་ཐོས་ནས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Thereupon, those bodhisattvas who had come to the Sahā world with the bodhisattva Holding the Lamp of Gnosis, having heard the Dharma from the Bhagavān Śākyamuni, gained forbearance toward phenomena as unborn.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་སྒྲོན་མ་འཛིན་དང་ལྷན་ཅིག་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་བཅུ་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རབ་ཏུ་གཡོས་པར་བྱས་ཏེ།
en: Then those hundred million bodhisattvas who had arrived with the bodhisattva Holding the Lamp of Gnosis bowed their heads to the feet of the Bhagavān and circumambulated him seven times. When they did this, this world of the great trichiliocosm shook and trembled.

source: བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་ནས་མི་སྣང་བར་གྱུར་ནས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་དེར་ཕྱིན་ཏོ། །
en: They then disappeared from before the Bhagavān, and in the merest instant returned to their world.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །
en: The Bhagavān then instructed Venerable Ānanda, “Ānanda, memorize this Dharma discourse!

source: ཆོངས་ཤིག །
en: Keep it safe, recite it, and study it.

source: ལྷོགས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་ཅིག །
en: Teach it widely to others.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཟུང་ལགས་ན་འདིའི་མིང་ཇི་སྐད་བགྱི་བར་གཟུང་བར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Ānanda replied, “Bhagavān, when I memorize this Dharma discourse, what should I call it?”

source: ཀུན་དགའ་བོ་དེ་བས་ན་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཇམ་དཔལ་གྱི་ལེའུ་དང་། སངས་རྒྱས་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ལྷའི་བུ་དཔལ་བཟངས་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་།
en: The Bhagavān told him, “Ānanda, remember this Dharma discourse as Mañjuśrī’s Chapter and The Teaching on the Inconceivable Scope of a Buddha.”

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: When the Bhagavān said this, the god Śrībhadra, Venerable Ānanda, the entire assembly, and the whole world with its gods, humans, asuras, and gandharvas rejoiced, praising what the Bhagavān had said.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་སངས་རྒྱས་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་ལྔ་པ་རྫོགས་སོ།། །།
en: This concludes “The Teaching on the Inconceivable Scope of a Buddha,” the thirty-fifth part of The Noble Dharma Discourse, the Great Heap of Jewels, in one hundred thousand parts.

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། མུ་ནི་བར་མ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ། སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།། །།
en: Translated and edited by the Indian preceptors Jinamitra, Dānaśīla, and Munivarman, and the great editor-translator Bandé Yeshé Dé, and corrected and finalized according to the revised terminology.
